Revit 2027 API
AdaptiveComponentInstanceUtils.CreateAdaptiveComponentInstance Method
 Creates a FamilyInstance of Adaptive Component Family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FamilyInstance CreateAdaptiveComponentInstance(
	Document doc,
	FamilySymbol famSymb
)
Public Shared Function CreateAdaptiveComponentInstance (
	doc As Document,
	famSymb As FamilySymbol
) As FamilyInstance
public:
static FamilyInstance^ CreateAdaptiveComponentInstance(
	Document^ doc,
	FamilySymbol^ famSymb
)
static member CreateAdaptiveComponentInstance :
        doc : Document *
        famSymb : FamilySymbol -> FamilyInstance
Parameters
doc Document
 The Document
famSymb FamilySymbol
 The FamilySymbol
Return Value
FamilyInstance
 The Family Instance
Exceptions
Exception | Condition
ArgumentException |  The element famSymb was not found in the given document. -or- The Symbol famSymb is not an Adaptive Family Symbol.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Unable to create adaptive component instance.
Remarks
 This method creates an Adaptive FamilyInstance and its PointElement references. The references can be accessed by methods like GetInstancePointElementRefIds(). The PointElement references can be moved, rehosted or manipulated just like any other PointElements. The FamilyInstance would then 'adapt' to these references.
See Also
Reference
AdaptiveComponentInstanceUtils Class
Autodesk.Revit.DB Namespace